MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX675F512L.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="-------------------------rrrrrrr" edc:cname="TraceControl2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TraceControl2" edc:nmmrflags="0b" edc:nmmrid="476" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SyP" edc:desc="" edc:mask="0x7" edc:name="SyP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TBU" edc:desc="" edc:mask="0x1" edc:name="TBU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TBI" edc:desc="" edc:mask="0x1" edc:name="TBI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ValidModes" edc:desc="" edc:mask="0x3" edc:name="ValidModes" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserTraceData" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="UserTraceData" edc:nmmrflags="0c" edc:nmmrid="604" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Data" edc:desc="" edc:mask="0xffffffff" edc:name="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="n-------------nnn-----------nnnn" edc:cname="TraceBPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TraceBPC" edc:nmmrflags="0d" edc:nmmrid="732" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IBPOn" edc:desc="" edc:mask="0xf" edc:name="IBPOn" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBPOn" edc:desc="" edc:mask="0x3" edc:name="DBPOn" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="DE" edc:desc="" edc:mask="0x1" edc:name="DE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Debug2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Debug2" edc:nmmrflags="0e" edc:nmmrid="860" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="debug2" edc:desc="" edc:mask="0xffffffff" edc:name="debug2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DEPC" edc:nmmrflags="0t" edc:nmmrid="224" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEPC" edc:desc="" edc:mask="0xffffffff" edc:name="DEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ErrorEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ErrorEPC" edc:nmmrflags="0t" edc:nmmrid="248" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ErrorEPC" edc:desc="" edc:mask="0xffffffff" edc:name="ErrorEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DESAVE" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DESAVE" edc:nmmrflags="0t" edc:nmmrid="252" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DESAVE" edc:desc="" edc:mask="0xffffffff" edc:name="DESAVE" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo" edc:nmmrflags="St" edc:nmmrid="1152" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi" edc:nmmrflags="St" edc:nmmrid="1156" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xffffffff" edc:endaddr="0xffffffff" edc:mask="0xff000" edc:regionid="devid" edc:useinchecksum="0xff000" edc:value="0x4311053">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x00000000"/>
      <edc:DEVIDToRev edc:revlist="A1" edc:value="0x10000000"/>
      <edc:DEVIDToRev edc:revlist="A3" edc:value="0x30000000"/>
      <edc:DEVIDToRev edc:revlist="A4" edc:value="0x40000000"/>
      <edc:DEVIDToRev edc:revlist="A5" edc:value="0x50000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d080000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc02ff0" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="bootconfig"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc02ff0" edc:endaddr="0x1fc03000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="config">
      <edc:DCRDef edc:_addr="0x1FC02FF0" edc:access="nn----nn-----nnnnnnnnnnnnnnnnnnn" edc:cname="DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xc307ffff" edc:name="DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xc3070000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="FSRSSEL" edc:desc="SRS Select" edc:mask="0x7" edc:name="FSRSSEL" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="PRIORITY_0" edc:desc="SRS Priority 0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_1" edc:desc="SRS Priority 1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_2" edc:desc="SRS Priority 2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_3" edc:desc="SRS Priority 3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_4" edc:desc="SRS Priority 4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_5" edc:desc="SRS Priority 5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_6" edc:desc="SRS Priority 6" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PRIORITY_7" edc:desc="SRS Priority 7" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FETHIO" edc:desc="Ethernet I/O Pin Select" edc:mask="0x1" edc:name="FETHIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Alternate Ethernet I/O" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Default Ethernet I/O" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO" edc:desc="USB USID Selection" edc:mask="0x1" edc:name="FUSBIDIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Controlled by Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSONIO" edc:desc="USB VBUS ON Selection" edc:mask="0x1" edc:name="FVBUSONIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Controlled by Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Controlled by USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC02FF4" edc:access="-------------nnnn----nnn-nnn-nnn" edc:cname="DEVCFG2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x78777" edc:name="DEVCFG2" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x78777">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPLLIDIV" edc:desc="PLL Input Divider" edc:mask="0x7" edc:name="FPLLIDIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="1x Divider" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_3" edc:desc="3x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_5" edc:desc="5x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_6" edc:desc="6x Divider" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_10" edc:desc="10x Divider" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_12" edc:desc="12x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLMUL" edc:desc="PLL Multiplier" edc:mask="0x7" edc:name="FPLLMUL" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="MUL_15" edc:desc="15x Multiplier" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MUL_16" edc:desc="16x Multiplier" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MUL_17" edc:desc="17x Multiplier" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MUL_18" edc:desc="18x Multiplier" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="MUL_19" edc:desc="19x Multiplier" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="MUL_20" edc:desc="20x Multiplier" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="MUL_21" edc:desc="21x Multiplier" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MUL_24" edc:desc="24x Multiplier" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="UPLLIDIV" edc:desc="USB PLL Input Divider" edc:mask="0x7" edc:name="UPLLIDIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="1x Divider" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_3" edc:desc="3x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_5" edc:desc="5x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_6" edc:desc="6x Divider" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_10" edc:desc="10x Divider" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_12" edc:desc="12x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="UPLLEN" edc:desc="USB PLL Enable" edc:mask="0x1" edc:name="UPLLEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled and Bypassed" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FPLLODIV" edc:desc="System PLL Output Clock Divider" edc:mask="0x7" edc:name="FPLLODIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="PLL Divide by 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="PLL Divide by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="PLL Divide by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="PLL Divide by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_16" edc:desc="PLL Divide by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="PLL Divide by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_64" edc:desc="PLL Divide by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_256" edc:desc="PLL Divide by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
